Revit 2027 API
ExportSheetType Enumeration
 An enumerated type listing possible Sheet type.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public enum ExportSheetType
Public Enumeration ExportSheetType
public enum class ExportSheetType
type ExportSheetType
Members
Member name | Value | Description
Current | 0
Select | 2
Visible | 1
See Also
Reference
Autodesk.Revit.DB Namespace